{
    "Array": "This class provides a way of storing more than one value for a given name. These values can be accessed by another index.",
    "Array_ContainsIndex": "Gets whether or not the array contains the specified index. This is very useful when deciding if the array's index was initialized by some value or not.",
    "Array_ContainsIndex_Array": "The array to check.",
    "Array_ContainsIndex_Index": "The index to check.",
    "Array_ContainsValue": "Gets whether or not the array contains the specified value. This is very useful when deciding if the array's value was stored in some index.",
    "Array_ContainsValue_Array": "The array to check.",
    "Array_ContainsValue_Index": "The index to check.",
    "Array_GetAllIndices": "Gets all the indices for the array, as another array. The index of the returned array starts from 1.",
    "Array_GetAllIndices_Array": "The array whose indices are requested.",
    "Array_GetItemCount": "Gets the count of all the items in the array.",
    "Array_GetItemCount_Array": "The array whose item count is requested.",
    "Array_IsArray": "Checks whether the value passed is an array or not.",
    "Array_IsArray_Value": "The value to check.",
    "Clock": "This class provides access to the system clock.",
    "Clock_Time": "Gets the current system time.",
    "Program": "The Program class provides helpers to control the program execution.",
    "Program_Pause": "Pauses the program execution for debugging.",
    "Program_End": "Ends the program.",
    "Stack": "This object provides a way of storing values just like stacking up a plate. You can push a value to the top of the stack and pop it off. You can only pop the values one by one off the stack and the last pushed value will be the first one to pop out.",
    "Stack_PushValue": "Pushes a value to the specified stack.",
    "Stack_PushValue_StackName": "The name of the stack.",
    "Stack_PushValue_Value": "The value to push.",
    "Stack_GetCount": "Gets the count of items in the specified stack.",
    "Stack_GetCount_StackName": "The name of the stack.",
    "Stack_PopValue": "Pops a value from the specified stack.",
    "Stack_PopValue_StackName": "The name of the stack.",
    "TextWindow": "The TextWindow provides text-related input and output functionalities. For example using this class, it is possible to write or read some text or number to and from the text-based text window.",
    "TextWindow_Read": "Reads a line of text from the text window. Returns the string entered by the user.",
    "TextWindow_ReadNumber": "Reads a number from the text window. Returns the number entered by the user.",
    "TextWindow_Write": "Writes a string or a number to the text window on the same line.",
    "TextWindow_Write_Data": "The string or number to be written to the text window.",
    "TextWindow_WriteLine": "Writes a string or a number to the text window on its own line.",
    "TextWindow_WriteLine_Data": "The string or number to be written to the text window.",
    "TextWindow_ForegroundColor": "Gets or sets the foreground color of the text to be output in the text window.",
    "TextWindow_BackgroundColor": "Gets or sets the background color of the text to be output in the text window."
}